voytxt/nxp-internship/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTB18 (number 64), J1[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BT_S_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_BT_S_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_BT_S_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_BT_S_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_BT_S_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC1 (number 71), J1[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ENC_SW_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ENC_SW_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ENC_SW_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_ENC_SW_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_ENC_SW_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC8 (number 80), J1[7]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BT_E_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_BT_E_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_BT_E_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_BT_E_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_BT_E_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTC9 (number 81), J1[9]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ENC_A_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ENC_A_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ENC_A_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_ENC_A_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_ENC_A_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC0 (number 70), J1[11]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_ENC_B_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_ENC_B_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_ENC_B_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_ENC_B_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_ENC_B_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC7 (number 79), J1[13]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BT_N_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_BT_N_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_BT_N_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_BT_N_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_BT_N_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTC5 (number 77), J1[15]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_BT_W_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_BT_W_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_BT_W_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_BT_W_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_BT_W_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB23 (number 69), J1[10]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_G_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_G_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_G_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_G_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_LED_G_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                              /* @} */

/*! @name PORTC2 (number 72), J1[14]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_B_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_B_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_B_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_B_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_LED_B_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC3 (number 73), J1[16]
  @{ */

