voytxt/nxp-internship/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LED_R_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_R_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_LED_R_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_LED_R_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_LED_R_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                             /* @} */

/*! @name PORTC4 (number 76), J2[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_MFP_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_MFP_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_MFP_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_MFP_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_MFP_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTD0 (number 93), J2[6]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW1_EXT_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW1_EXT_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW1_EXT_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW1_EXT_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_SW1_EXT_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTD2 (number 95), SW2_EXT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_EXT_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_EXT_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW2_EXT_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW2_EXT_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_SW2_EXT_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTD3 (number 96), J2[10]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_EXT_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_EXT_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW3_EXT_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW3_EXT_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_SW3_EXT_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTD1 (number 94), J2[12]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SW4_EXT_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW4_EXT_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SW4_EXT_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_SW4_EXT_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_SW4_EXT_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PORTB2 (number 55), J4[2]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_DB7_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_DB7_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_DB7_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DB7_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_DB7_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTB3 (number 56), J4[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_DB6_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_DB6_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_DB6_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DB6_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_DB6_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name PORTB10 (number 58), J4[6]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_DB5_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_DB5_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_DB5_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_DB5_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_DB5_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTB11 (number 59), J4[8]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_DB4_GPIO GPIOB                /*!<@brief GPIO peripheral base pointer */
#define BOARD_DB4_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_DB4_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define BOARD_DB4_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_DB4_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTC11 (number 83), J4[10]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_D_E_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define BOARD_D_E_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_D_E_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define BOARD_D_E_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_D_E_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                            /* @} */

/*! @name PORTC10 (number 82), J4[12]
  @{ */

